CSI API ETABS v1
cPropLink.SetMultiLinearPoints Method
 Sets the force-deformation data for a specified degree of freedom in multilinear elastic and multilinear plastic link properties.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetMultiLinearPoints(
	string Name,
	int DOF,
	int NumberPoints,
	ref double[] F,
	ref double[] D,
	int MyType = 1,
	double A1 = 0,
	double A2 = 0,
	double B1 = 0,
	double B2 = 0,
	double Eta = 0
)
Function SetMultiLinearPoints (
	Name As String,
	DOF As Integer,
	NumberPoints As Integer,
	ByRef F As Double(),
	ByRef D As Double(),
	Optional MyType As Integer = 1,
	Optional A1 As Double = 0,
	Optional A2 As Double = 0,
	Optional B1 As Double = 0,
	Optional B2 As Double = 0,
	Optional Eta As Double = 0
) As Integer
Dim instance As cPropLink
Dim Name As String
Dim DOF As Integer
Dim NumberPoints As Integer
Dim F As Double()
Dim D As Double()
Dim MyType As Integer
Dim A1 As Double
Dim A2 As Double
Dim B1 As Double
Dim B2 As Double
Dim Eta As Double
Dim returnValue As Integer
returnValue = instance.SetMultiLinearPoints(Name,
	DOF, NumberPoints, F, D, MyType, A1,
	A2, B1, B2, Eta)
int SetMultiLinearPoints(
	String^ Name,
	int DOF,
	int NumberPoints,
	array<double>^% F,
	array<double>^% D,
	int MyType = 1,
	double A1 = 0,
	double A2 = 0,
	double B1 = 0,
	double B2 = 0,
	double Eta = 0
)
abstract SetMultiLinearPoints :
        Name : string *
        DOF : int *
        NumberPoints : int *
        F : float[] byref *
        D : float[] byref *
        ?MyType : int *
        ?A1 : float *
        ?A2 : float *
        ?B1 : float *
        ?B2 : float *
        ?Eta : float
(* Defaults:
        let _MyType = defaultArg MyType 1
        let _A1 = defaultArg A1 0
        let _A2 = defaultArg A2 0
        let _B1 = defaultArg B1 0
        let _B2 = defaultArg B2 0
        let _Eta = defaultArg Eta 0
*)
-> int
Parameters
Name
Type: System.String
The name of an existing multilinear elastic or multilinear plastic link property.
DOF
Type: System.Int32
This is 1, 2, 3, 4, 5 or 6, indicating the degree of freedom to which the multilinear points apply.
Value | DOF
1 | U1
2 | U2
3 | U3
4 | R1
5 | R2
6 | R3
NumberPoints
Type: System.Int32
The number of foce-defomation points for the specified degree of freedom.
F
Type: System.Double[]
This is an array, dimensioned to NumberPoints - 1, that includes the force at each point. When DOF is U1, U2 or U3, this is a force. When DOF is R1, R2 or R3. this is a moment. [F] if DOF is less than or equal to 3, and [FL] if DOF is greater than 3.
D
Type: System.Double[]
This is an array, dimensioned to NumberPoints - 1, that includes the displacement at each point. When DOF is U1, U2 or U3, this is a translation. When DOF is R1, R2 or R3, this is a rotation. [L] if DOF is less than or equal to 3, and [rad] if DOF is greater than 3.
MyType (Optional)
Type: System.Int32
This item applies only to multilinear plastic link properties. It is 1, 2 or 3, indicating the hysteresis type.
MyTpe | Hysteresis Type
1 | Kinematic
2 | Takeda
3 | Pivot
A1 (Optional)
Type: System.Double
This item applies only to multilinear plastic link properties that have a pivot hysteresis type (MyType = 3). It is the Alpha1 hysteresis parameter.
A2 (Optional)
Type: System.Double
This item applies only to multilinear plastic link properties that have a pivot hysteresis type (MyType = 3). It is the Alpha2 hysteresis parameter.
B1 (Optional)
Type: System.Double
This item applies only to multilinear plastic link properties that have a pivot hysteresis type (MyType = 3). It is the Beta1 hysteresis parameter.
B2 (Optional)
Type: System.Double
This item applies only to multilinear plastic link properties that have a pivot hysteresis type (MyType = 3). It is the Beta2 hysteresis parameter.
Eta (Optional)
Type: System.Double
This item applies only to multilinear plastic link properties that have a pivot hysteresis type (MyType = 3). It is the Eta hysteresis parameter.
Return Value
Type: Int32
Returns zero if the data is successfully assigned; otherwise it returns a nonzero value.
Remarks
To successfully apply this data to the indicated link property, the following conditions must be met:
The link property must be multilinear elastic or multilinear plastic.
The specified DOF must be active.
The specified DOF must not be fixed.
The specified DOF must be nonlinear.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim MyDOF() As Boolean
       Dim MyFixed() As Boolean
       Dim MyNonLinear() as Boolean
       Dim MyKe() As Double
       Dim MyCe() As Double
       Dim MyF() As Double
       Dim MyD() As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add link property
       ReDim MyDOF(5)
       ReDim MyFixed(5)
       ReDim MyNonLinear(5)
       ReDim MyKe(5)
       ReDim MyCe(5)
       MyDOF(0) = True
       MyKe(0) = 12
       MyCe(0) = 0.01
       MyDOF(1) = True
       MyNonLinear(1) = True
       MyKe(1) = 12
       MyCe(1) = 0.01
       MyDOF(2) = True
       MyFixed(2) = True
       ret = SapModel.PropLink.SetMultiLinearPlastic("MLP1", MyDOF, MyFixed, MyNonLinear, MyKe, MyCe, 2, 0)
   'set multilinear force-defomation data
       ReDim MyF(4)
       ReDim MyD(4)
       MyF(0) = -12
       MyF(1) = -10
       MyF(2) = 0
       MyF(3) = 8
       MyF(4) = 9
       MyD(0) = -8
       MyD(1) = -0.6
       MyD(2) = 0
       MyD(3) = 0.2
       MyD(4) = 6
       ret = SapModel.PropLink.SetMultiLinearPoints("MLP1", 2, 5, MyF, MyD, 3, 9, 12, 0.75, 0.8, .1)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropLink Interface
ETABSv1 Namespace